In [2]:
import pandas as pd 
import seaborn as sns

In [3]:
df = pd.read_csv("loan.csv")
df.head(10)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,LoanAmount
0,LP1000,Male,Yes,2,Graduate,No,16337,370.0
1,LP1001,NaN,Yes,0,Graduate,NaN,24986,280.0
2,LP1002,Female,Yes,0,Graduate,No,8812,190.0
3,LP1003,Female,Yes,3+,Graduate,No,6820,340.0
4,LP1004,Male,No,2,Graduate,No,14716,NaN
5,LP1005,Male,Yes,0,Not Graduate,No,24016,460.0
6,LP1006,Male,Yes,0,Graduate,No,4279,NaN
7,LP1007,Female,No,2,Graduate,Yes,18808,210.0
8,LP1008,Female,Yes,0,Not Graduate,NaN,3081,90.0
9,LP1009,Female,Yes,0,Graduate,Yes,21208,330.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Loan_ID          100 non-null    object
 1   Gender           91 non-null     object
 2   Married          97 non-null     object
 3   Dependents       90 non-null     object
 4   Education        100 non-null    object
 5   Self_Employed    83 non-null     object
 6   ApplicantIncome  100 non-null    int64
 7   LoanAmount       81 non-null     float64
dtypes: float64(1), int64(1), object(6)
memory usage: 6.4+ KB

In [5]:
df.shape

(100, 8)

In [6]:
# df["Gender"].mode()[0]
df["Gender"].fillna(df["Gender"].mode()[0],inplace=True)

In [7]:
df.isnull().sum()

Loan_ID             0
Gender              0
Married             3
Dependents         10
Education           0
Self_Employed      17
ApplicantIncome     0
LoanAmount         19
dtype: int64

In [8]:
df["Married"].fillna(df["Married"].mode()[0],inplace=True)

In [9]:
df.isnull().sum()

Loan_ID             0
Gender              0
Married             0
Dependents         10
Education           0
Self_Employed      17
ApplicantIncome     0
LoanAmount         19
dtype: int64

In [10]:
en_data = df[["Gender"]]

In [11]:
en_data

    Gender
0     Male
1     Male
2   Female
3   Female
4     Male
..     ...
95  Female
96  Female
97    Male
98    Male
99    Male

[100 rows x 1 columns]

In [12]:
pd.get_dummies(en_data)

    Gender_Female  Gender_Male
0           False         True
1           False         True
2            True        False
3            True        False
4           False         True
..            ...          ...
95           True        False
96           True        False
97          False         True
98          False         True
99          False         True

[100 rows x 2 columns]

In [13]:
from sklearn.preprocessing import OneHotEncoder

In [ ]:
ohe = OneHotEncoder(drop="first")
ar = ohe.fit_transform(en_data).toarray()

In [20]:
new = pd.DataFrame(ar,columns=["Gender_Male"])